"""Поработайте с переменными, создайте несколько, выведите на экран. Запросите у
пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран."""
print("Задание №1")
age = 20
name = input("Введите Имя")
age_one = input("Введите возраст")
print("Сколько не взрослей" + name + "все равно на " + str(age) + " будешь выглядеть")

"""Пользователь вводит время в секундах. Переведите время в часы, минуты, секунды и
выведите в формате чч:мм:сс. Используйте форматирование строк."""
print("Задание №2")
seconds_time = int(input("Введите время в секундах "))
hour_time = (seconds_time) // 120
minuts_time = (seconds_time) // 60
second_time = (seconds_time) % 60
print("Ваше время " + str(hour_time) + ":" + str(minuts_time) + ":" + str(second_time))

"""Узнайте у пользователя число n. Найдите сумму чисел n + nn + nnn. Например, пользователь
ввёл число 3. Считаем 3 + 33 + 333 = 369."""

print("Задание №3")
n = str(input("Введите число "))
a = int(n)
b = n + n
c = n + n + n
total = int(a) + int(b) + int(c)
print(total)

"""Пользователь вводит целые положительные числа. Найдите самую большую цифру в числе.
Для решения используйте цикл while и арифметические операции."""
print("Задание №4")
A = int(input('Введите число: '))
B = int(input('Введите число: '))
C = int(input('Введите число: '))
D = int(input('Введите число: '))
i = [A, B, C, D]
while i:
    max_number = int(max(i))
    print("Максимальное число " + str(max_number))
    break

print("Задание №5,6")
"""Запросите у пользователя значения выручки и издержек фирмы. Определите,
с каким финансовым результатом работает фирма. Например, прибыль — выручка больше
издержек, или убыток — издержки больше выручки. Выведите соответствующее сообщение."""
profit = int(input("Введите прибыль "))
proceeds = int(input("Введите выручку "))
cost = int(input("Введите издержку "))
if proceeds > cost:
    print("Вы работаете в прибыль")
    profit1 = profit - proceeds
    print("Ваша рентабельная выручка " + str(profit1))
    workmans = input("Введите количество сотрудников ")
    total = int(profit) / int(workmans)
    print("прибыль на одного работника "+ str(total))
else:
    print("Вы работаете у убыток , увольте кого-нить")

print("Задание №7")
a = 2
b = 3
count = 0
while a <= (b + (b/10)):
    count += 1
    print(str(count)+ "-й день: " + str(a))
    a = a + (a/10)
print("На " + str(count) + " день спортсмен достиг результата не менее " + str(b) + " км.")